Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
#include <zephyr/device.h>
#include <zephyr/devicetree.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/drivers/clock_control/nrf_clock_control.h>
#include <zephyr/drivers/gpio.h>
#include <zephyr/drivers/uart.h>
#include <zephyr/kernel.h>
#include <zephyr/logging/log.h>
#include <zephyr/sys/atomic.h>
#include <zephyr/sys/printk.h>
#include <zephyr/sys/reboot.h>
#include <zephyr/types.h>
#include <string.h>

#include <esb.h>

#include "usbd_init.h"
#include "ota_hub_relay.hpp"

#if defined(CONFIG_BT)
#include <zephyr/bluetooth/bluetooth.h>
#endif

#if defined(CONFIG_BT) && defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
#include <zephyr/bluetooth/conn.h>
#include <zephyr/bluetooth/gatt.h>
#include <zephyr/devicetree/fixed-partitions.h>
#include <zephyr/dfu/mcuboot.h>
#include <pm_config.h>
#include <zephyr/storage/flash_map.h>

#include "BleOtaService.hpp"
#include "IOtaManager.hpp"
#include "OtaManager.hpp"
#include "OtaTargetIdentity.hpp"
#include "ZephyrOtaFlashBackend.hpp"
#endif

LOG_MODULE_REGISTER(helix_mocap_bridge, LOG_LEVEL_INF);

enum {
	HELIX_PACKET_SYNC_ANCHOR = 0xA1,
	HELIX_PACKET_MOCAP_FRAME = 0xC1,
	HELIX_PACKET_OTA_TRIGGER = 0xE1,
};

/* Magic value to prevent accidental OTA triggers. Must match on both sides. */
static constexpr uint32_t kOtaTriggerMagic = 0xDEADBEEFu;

struct __packed HelixSyncAnchor {
	uint8_t type;
	uint8_t central_id;
	uint8_t anchor_sequence;
	uint8_t session_tag;
	uint32_t central_timestamp_us;
	/* v2+: flags byte. bit0 = tell target tag to reboot into BLE OTA
	 * window. Anchors of the OLD 8-byte size are still accepted
	 * (flags defaults to 0 when absent). */
	uint8_t flags;
	/* v3+: target node_id for OTA trigger. Needed because Hub now
	 * FLOODS the OTA_REQ flag in every anchor during the trigger window
	 * (not just the target's ACKs) — so each receiving Tag must be able
	 * to tell whether the flag is for it. 0xFF = broadcast (all nodes).
	 * Tags that see the old 9-byte anchor (no target_id field) treat
	 * the OTA_REQ flag as broadcast — preserves legacy single-target
	 * behaviour for fleets that haven't migrated to v3 anchors yet. */
	uint8_t ota_target_node_id;
	/* v4+: the Hub's view of which Tag's frame triggered this ACK
	 * payload. With N Tags sharing pipe 0 (one ESB ACK-payload FIFO),
	 * the anchor built for Tag A may well be delivered to Tag B — see
	 * docs/RF_SYNC_DECISION_LOG.md Stage 2. Tags MUST filter anchors
	 * where rx_node_id != own node_id out of the sync estimator (OTA
	 * flags stay in effect — they're already filtered by
	 * ota_target_node_id). 0xFF = unset/broadcast (accept). */
	uint8_t rx_node_id;
	/* v5+: echo of the Tag's frame->sequence that caused the Hub to
	 * build this anchor. Tag uses it to look up its own TX timestamp
	 * in a small ring buffer — necessary because NCS ESB doesn't tell
	 * the Tag which of its retries got ACK'd, so "most recent TX" is
	 * ambiguous by several retry slots. See docs/RF_STAGE3_DESIGN.md. */
	uint8_t rx_frame_sequence;
	/* v5+: Hub's local clock reading just before esb_write_payload.
	 * Combined with rx_frame_sequence → tx_local_us lookup on Tag side
	 * this enables a midpoint-RTT sync estimator that cancels the
	 * systematic ACK-TX-latency bias observed in Stage 1'. Note: this
	 * is a QUEUE-time stamp, not hardware-TX-time, because ESB doesn't
	 * give user code a pre-TX callback. Tag's midpoint math treats it
	 * as a best-effort TX time and measurements will reveal the
	 * residual bias. */
	uint32_t anchor_tx_us;
};

static constexpr uint8_t HELIX_ANCHOR_FLAG_OTA_REQ = 0x01u;

struct __packed HelixOtaTrigger {
	uint8_t type;           /* HELIX_PACKET_OTA_TRIGGER */
	uint8_t central_id;
	uint8_t target_node_id; /* 0xFF = broadcast */
	uint8_t session_tag;
	uint32_t magic;         /* kOtaTriggerMagic */
};

struct __packed HelixMocapFrame {
	uint8_t type;
	uint8_t node_id;
	uint8_t sequence;
	uint8_t session_tag;
	uint32_t node_local_timestamp_us;
	uint32_t node_synced_timestamp_us;
	int16_t yaw_cdeg;
	int16_t pitch_cdeg;
	int16_t roll_cdeg;
	int16_t x_mm;
	int16_t y_mm;
	int16_t z_mm;
};

struct HelixMocapStatus {
	uint32_t magic;
	uint32_t role;
	uint32_t heartbeat;
	uint32_t phase;
	uint32_t tx_attempts;
	uint32_t tx_success;
	uint32_t tx_failed;
	uint32_t rx_packets;
	uint32_t anchors_sent;
	uint32_t anchors_received;
	uint32_t usb_lines;
	uint32_t tracked_nodes;
	int32_t estimated_offset_us;
	uint32_t last_node_id;
	uint32_t last_sequence;
	uint32_t last_rx_len;
	uint32_t last_error;
};

struct NodeTrack {
	uint8_t node_id;
	bool active;
	uint32_t packets;
	uint32_t gaps;
	uint8_t last_sequence;
	uint32_t last_node_timestamp_us;
	uint32_t last_synced_timestamp_us;
	uint32_t last_rx_timestamp_us;
};

volatile struct HelixMocapStatus g_helixMocapStatus;

/* ── Persistent node_id (flash-backed) ──────────────────────────────
 *
 * Single firmware binary for all 10 Tags. Each Tag's unique node_id is
 * stored in the first word of the settings_storage partition at 0xFE000
 * (we have CONFIG_SETTINGS=n so that 8 KB page is otherwise unused).
 *
 * Layout: [node_id:u8][0xFF:u8][0xFF:u8][0xFF:u8]
 *   lower byte = node_id (1..255); sentinel 0xFFFFFFFF = unprovisioned.
 *
 * Provisioning (SWD): after `nrfutil device program` (which erases the
 * whole flash, so this word ends up as 0xFFFFFFFF), write the node_id:
 *   nrfutil device write --address 0xFE000 --value 0xFFFFFF<nn> --direct
 *
 * If unprovisioned, we fall back to CONFIG_HELIX_MOCAP_NODE_ID so dev
 * workflow still works on a single Tag.
 *
 * OTA never touches this page (MCUboot overwrite-only only writes
 * mcuboot_secondary at 0x85000-0xFE000), so node_id persists forever
 * after provisioning.
 */
static constexpr uint32_t kHelixConfigAddr = 0xFE000u;
#if defined(PM_SETTINGS_STORAGE_ADDRESS)
static_assert(kHelixConfigAddr == PM_SETTINGS_STORAGE_ADDRESS,
              "node_id flash address must match settings_storage partition base");
#endif
static uint8_t g_node_id = (uint8_t)CONFIG_HELIX_MOCAP_NODE_ID;

static uint8_t helix_load_node_id(void)
{
	const uint32_t val = *reinterpret_cast<const volatile uint32_t *>(kHelixConfigAddr);
	if (val == 0xFFFFFFFFu) {
		return (uint8_t)CONFIG_HELIX_MOCAP_NODE_ID;
	}
	const uint8_t id = (uint8_t)(val & 0xFFu);
	if (id == 0u) {
		return (uint8_t)CONFIG_HELIX_MOCAP_NODE_ID;
	}
	return id;
}

