Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
static const struct gpio_dt_spec led = GPIO_DT_SPEC_GET_OR(DT_ALIAS(led0), gpios, {0});
static const struct device *const host_stream = DEVICE_DT_GET(DT_CHOSEN(zephyr_console));
static struct esb_payload rx_payload;
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
static struct esb_payload tx_payload;
static atomic_t tx_ready = ATOMIC_INIT(1);
static bool have_anchor;
static int32_t estimated_offset_us;
/* Set from ESB ISR when an OTA trigger arrives; main loop reboots. */
static atomic_t ota_reboot_pending = ATOMIC_INIT(0);

/* ── RF-sync instrumentation (Stage 1 per docs/RF_SYNC_DECISION_LOG.md) ──
 * Tag side. Histograms stay in RAM and get emitted in the SUMMARY line.
 * last_tx_local_us: local_us at the moment we queued the most recent
 *   ESB TX frame. Pair it against anchor RX time to see how quickly
 *   Hub's anchor came back.
 * anchor_age_bucket: distribution of (local_at_anchor_rx - last_tx_local_us)
 *   buckets [<2 ms, 2-10 ms, 10-30 ms, >=30 ms]. A bimodal distribution
 *   with most weight in bucket 0 means anchors mostly hit Hub's TIFS
 *   window; weight in buckets 2/3 means the slow-path is dominant.
 * offset_step_bucket: distribution of |new_offset - old_offset| across
 *   anchors — large jumps mean bad / stale anchors are corrupting the
 *   estimator (a key symptom of the shared-pipe cross-contamination). */
static volatile uint32_t last_tx_local_us;
static volatile uint32_t anchor_age_bucket[4];
static volatile uint32_t offset_step_bucket[4];
/* Stage 2 (v4 anchor): count anchors filtered out because rx_node_id
 * didn't match our own. Ratio of this to total anchors received tells
 * us how much shared-pipe cross-contamination we're rejecting. */
static volatile uint32_t anchors_wrong_rx;

/* Stage 3 (v5 anchor): per-Tag ring buffer of recent TXs, indexed by
 * Tag's own sequence number. On anchor RX, the Hub echoes back
 * frame->sequence in rx_frame_sequence; we look it up here to recover
 * the Tag-local TX timestamp for the midpoint estimator. Ring depth
 * 16 is well past any realistic Hub ACK-TX latency at 50 Hz (16 slots
 * × 20 ms per TX = 320 ms of history, vs. Stage 1' p99 ACK TX latency
 * of ~60 ms). See docs/RF_STAGE3_DESIGN.md. */
#define HELIX_TX_RING_SIZE   16u
#define HELIX_TX_RING_MASK   (HELIX_TX_RING_SIZE - 1u)
struct tx_stamp {
	uint8_t  sequence;
	uint8_t  valid;
	uint32_t local_us;
};
static volatile struct tx_stamp tx_ring[HELIX_TX_RING_SIZE];
/* Monotonic write index; index & MASK is slot. Producer:
 * maybe_send_frame on successful esb_write_payload. Consumer:
 * node_handle_anchor (ESB ISR) — single reader, single writer,
 * no locking needed on nRF52 single-core. */
static volatile uint32_t tx_ring_head;
/* Count of v5 anchors whose echoed sequence wasn't in the ring —
 * either too old (ring wrapped past it) or Hub echoed garbage.
 * Should be near-zero in steady state. */
static volatile uint32_t seq_lookup_miss;
/* Bucket midpoint-estimator jitter: |new_offset - prev_offset| for
 * the v5 midpoint estimator (separate from the old offset_step). */
static volatile uint32_t midpoint_step_bucket[4];
static volatile uint32_t midpoint_offset_valid;
static int32_t midpoint_offset_us;
#endif
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
static struct NodeTrack tracked_nodes[CONFIG_HELIX_MOCAP_MAX_TRACKED_NODES];
static uint8_t next_anchor_sequence;
/* When non-zero, the central injects an OTA trigger into the next ACK
 * payload for the target node (0xFF = broadcast). Cleared after send. */
static volatile uint8_t ota_trigger_target_node;
static volatile uint8_t ota_trigger_retries;
static volatile uint32_t ota_triggers_sent;

/* ── RF-sync instrumentation (Stage 1 per docs/RF_SYNC_DECISION_LOG.md) ──
 * Hub side. Measures whether Hub's anchor write makes the ~150 µs TIFS
 * window (fast path → anchor rides current frame's ACK, ~µs delay) or
 * misses it (slow path → anchor stays queued in pipe-0 FIFO and rides
 * a later frame's ACK, ~ms delay). Core measurement that turns the
 * "~70% slow path" hypothesis into a number.
 *
 * A naive single-slot last_queue_us has an asymmetric bias: when
 * several RX events fire before the oldest queued anchor's TX_SUCCESS
 * lands, the single slot gets overwritten and the oldest-anchor's
 * latency is measured against the newest queue time — either dropped
 * (negative delta) or compressed toward small buckets. That hides the
 * exact "old anchor waited behind a burst of RX" pattern we care
 * about. Fixed here with a FIFO ring matched against the ESB
 * ACK-payload TX FIFO. Both head and tail are only touched from the
 * ESB event-handler context (single-ISR execution in NCS v3.2.4), so
 * no locking is needed.
 *
 * Ring size: ESB_TX_FIFO_SIZE defaults to 8 in NCS; 16 leaves
 * headroom for any burst. Must be a power of 2 for the mask trick.
 * anchor_pending_max: observed peak FIFO depth (head - tail). */
#define HELIX_ANCHOR_QUEUE_RING   16u
#define HELIX_ANCHOR_QUEUE_MASK   (HELIX_ANCHOR_QUEUE_RING - 1u)
static_assert((HELIX_ANCHOR_QUEUE_RING & HELIX_ANCHOR_QUEUE_MASK) == 0u,
              "HELIX_ANCHOR_QUEUE_RING must be a power of 2");

static volatile uint32_t anchor_queue_ts_ring[HELIX_ANCHOR_QUEUE_RING];
static volatile uint32_t anchor_queue_ring_head;   /* next slot to write */
static volatile uint32_t anchor_queue_ring_tail;   /* next slot to consume */
static volatile uint32_t anchor_pending_max;
static volatile uint32_t ack_tx_latency_bucket[4];
static volatile uint32_t ack_tx_dropped_no_queue;  /* TX_SUCCESS with ring empty — diagnostic */

/* Request an OTA trigger for a specific node (or 0xFF = broadcast).
 * Sends the trigger on the next few FRAMEs from the target, then clears.
 * Called from the Hub relay when the PC requests a remote OTA trigger.
 *
 * Tear-down first, then arm. The ESB RX ISR reads ota_trigger_target_node
 * and ota_trigger_retries as an implicit pair; if we raced the two volatile
 * writes in the wrong order, the ISR could read the new target against the
 * old retries (or vice versa) and either send a stale flood or skip a new
 * one. Gate on target_node=0, barrier, then arm retries + target. The DMBs
 * force ordering on Cortex-M4 — cheap and sufficient since the ISR is on
 * the same core. (Copilot code review, 2026-04-20.) */
extern "C" void helix_request_ota_trigger(uint8_t node_id, uint8_t retries)
{
	ota_trigger_target_node = 0u;  /* gate: ISR ignores trigger during update */
	__DMB();
	ota_trigger_retries = retries;
	__DMB();
	ota_trigger_target_node = node_id;  /* arm */
}
#endif

static uint32_t now_us(void)
{
	return (uint32_t)(k_uptime_get() * 1000LL);
}

/* Bucket a µs-delta into 4 bins: [<2 ms, 2-10 ms, 10-30 ms, >=30 ms].
 * Used by the RF-sync instrumentation. Bumps bucket_arr[idx] and returns
 * the bucket index (0-3). Non-atomic — we accept occasional lost counts
 * from RX-ISR vs. main-thread races; instrumentation, not invariants. */
static inline uint32_t histo_bucket_us(uint32_t delta_us, volatile uint32_t *bucket_arr)
{
	uint32_t idx;
	if (delta_us < 2000u) idx = 0u;
	else if (delta_us < 10000u) idx = 1u;
	else if (delta_us < 30000u) idx = 2u;
	else idx = 3u;
	bucket_arr[idx]++;
	return idx;
}

