Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
	g_helixMocapStatus.last_node_id = frame->node_id;
	g_helixMocapStatus.last_sequence = frame->sequence;

	host_emit_frame(frame, rx_timestamp_us, gaps);

	struct esb_payload ack = {
		.pipe = payload->pipe,
	};

	/* Build anchor. When an OTA trigger is active, FLOOD every ACK
	 * payload with OTA_REQ + target node_id (not just ACKs going to the
	 * target). Previously we only tagged the ACK for the target Tag —
	 * but with N Tags sharing pipe 0 and heavy collisions, the target's
	 * ACK-carrying frames were the least likely to land, so triggers
	 * dropped ~50% first try (Copilot analysis, Apr 2026). Flooding
	 * every ACK means every Tag that does TX will see OTA_REQ in its
	 * next returned anchor and filter by target_node_id in firmware.
	 *
	 * retries now counts TOTAL flooded anchors sent (not per-target
	 * hits) — gives a time-bounded flood window regardless of which
	 * Tag happens to be RX'd. */
	const bool flooding = (ota_trigger_target_node != 0u);

	struct HelixSyncAnchor anchor = {
		.type = HELIX_PACKET_SYNC_ANCHOR,
		.central_id = (uint8_t)CONFIG_HELIX_MOCAP_CENTRAL_ID,
		.anchor_sequence = next_anchor_sequence++,
		.session_tag = (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG,
		.central_timestamp_us = rx_timestamp_us,
		.flags = static_cast<uint8_t>(flooding ? HELIX_ANCHOR_FLAG_OTA_REQ : 0),
		.ota_target_node_id = flooding ? ota_trigger_target_node : (uint8_t)0,
		/* v4: whose frame this anchor is built from. Tags check this
		 * and drop the sync update if the anchor wasn't for them. */
		.rx_node_id = frame->node_id,
		/* v5: Tag's own sequence number echoed back so Tag can pair
		 * this anchor with its own TX timestamp (Tag-side ring lookup). */
		.rx_frame_sequence = frame->sequence,
		/* v5: Hub's clock just before enqueue. Best-effort TX-time
		 * stamp (see comment on the struct field). */
		.anchor_tx_us = now_us(),
	};
	ack.length = sizeof(anchor);
	memcpy(ack.data, &anchor, sizeof(anchor));
	/* Push this anchor's queue time onto the FIFO ring so the matching
	 * ESB_EVENT_TX_SUCCESS can compute a per-anchor latency. See
	 * docs/RF_SYNC_DECISION_LOG.md Stage 1 instrumentation. */
	{
		const uint32_t head = anchor_queue_ring_head;
		anchor_queue_ts_ring[head & HELIX_ANCHOR_QUEUE_MASK] = rx_timestamp_us;
		anchor_queue_ring_head = head + 1u;
		const uint32_t pending = (head + 1u) - anchor_queue_ring_tail;
		if (pending > anchor_pending_max) {
			anchor_pending_max = pending;
		}
	}
	if (esb_write_payload(&ack) == 0) {
		g_helixMocapStatus.anchors_sent++;
		if (flooding) {
			ota_triggers_sent++;
			if (ota_trigger_retries > 0u) {
				ota_trigger_retries--;
			} else {
				ota_trigger_target_node = 0u; /* flood window done */
			}
		}
	}
}
#endif

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
static int16_t synth_wave(uint8_t sequence, int32_t mul, int32_t span)
{
	int32_t phase = ((int32_t)sequence * mul) % (span * 2);

	if (phase > span) {
		phase = (span * 2) - phase;
	}

	return (int16_t)(phase - (span / 2));
}

static void node_fill_frame(struct HelixMocapFrame *frame)
{
	const uint8_t sequence = (uint8_t)(g_helixMocapStatus.tx_attempts & 0xFF);
	const uint32_t local_us = now_us();
	/* Stage 3.5: prefer the v5 midpoint offset when it's locked. The
	 * midpoint estimator cancels the Hub ACK-TX queue-latency bias
	 * that dominates the old one-way estimator (Stage 3 findings
	 * showed ~30x reduction in 10-30ms offset_step bucket). Fall
	 * back to the v3 one-way estimator until we have our first
	 * midpoint lock — relevant in the first ~second after boot. */
	const int32_t sync_offset =
		midpoint_offset_valid ? midpoint_offset_us : estimated_offset_us;
	const uint32_t synced_us = local_us - (uint32_t)sync_offset;

	frame->type = HELIX_PACKET_MOCAP_FRAME;
	frame->node_id = g_node_id;
	frame->sequence = sequence;
	frame->session_tag = (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG;
	frame->node_local_timestamp_us = local_us;
	frame->node_synced_timestamp_us = synced_us;
	frame->yaw_cdeg = synth_wave(sequence, 37, 3600);
	frame->pitch_cdeg = synth_wave(sequence, 23, 1800);
	frame->roll_cdeg = synth_wave(sequence, 17, 1800);
	frame->x_mm = synth_wave(sequence, 11, 1200);
	frame->y_mm = synth_wave(sequence, 13, 1200);
	frame->z_mm = synth_wave(sequence, 19, 1200);
}

static void node_handle_anchor(const struct esb_payload *payload)
{
	if (payload->length < 1) {
		return;
	}

	/* Check for OTA trigger packet. This runs in ESB ISR context —
	 * just set the flag; the main loop does the actual reboot. */
	if (payload->data[0] == HELIX_PACKET_OTA_TRIGGER &&
	    payload->length >= sizeof(HelixOtaTrigger)) {
		const struct HelixOtaTrigger *trig =
			(const struct HelixOtaTrigger *)payload->data;
		if (trig->session_tag == (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG &&
		    trig->magic == kOtaTriggerMagic &&
		    (trig->target_node_id == 0xFFu ||
		     trig->target_node_id == g_node_id)) {
			atomic_set(&ota_reboot_pending, 1);
		}
		return;
	}

	const struct HelixSyncAnchor *anchor = (const struct HelixSyncAnchor *)payload->data;
	const uint32_t local_us = now_us();

	/* Anchor wire format has evolved; accept the five sizes on the wire:
	 *   v1 (8 B):  base fields only, no flags, no OTA trigger path.
	 *   v2 (9 B):  + flags byte (OTA_REQ bit). Any OTA_REQ → reboot.
	 *   v3 (10 B): + ota_target_node_id — filter by our node_id.
	 *   v4 (11 B): + rx_node_id — filter non-matching anchors out of the
	 *              sync estimator (shared-pipe cross-contamination fix).
	 *   v5 (16 B): + rx_frame_sequence + anchor_tx_us — enables midpoint
	 *              RTT sync estimator with full Hub+Tag clock pairing.
	 * sizeof(HelixSyncAnchor) is 16 (v5) on this branch; the size gates
	 * below dispatch to the right compat path. */
	constexpr size_t kLegacyAnchorSize = 8u;
	constexpr size_t kV2AnchorSize     = 9u;
	constexpr size_t kV3AnchorSize     = 10u;
	constexpr size_t kV4AnchorSize     = 11u;
	static_assert(sizeof(HelixSyncAnchor) == 16u,
	              "v5 anchor must be 16 bytes — update OTA trigger compat paths if this grows");
	if (payload->length < kLegacyAnchorSize ||
	    anchor->type != HELIX_PACKET_SYNC_ANCHOR ||
	    anchor->session_tag != (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG) {
		return;
	}

