Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
	/* Handle OTA trigger (piggybacked on anchor flags).
	 *  - 9-byte anchor (legacy): flag set → reboot (single-target semantics
	 *    because old Hubs only tagged the target's ACK).
	 *  - 10-byte anchor (v3+): Hub floods the flag on *every* ACK, so we
	 *    must filter by the ota_target_node_id field. 0xFF = broadcast
	 *    (reboot all). Own node_id (runtime, flash-provisioned) = targeted
	 *    reboot. Any other value = not for us, ignore. */
	if (!(anchor->flags & HELIX_ANCHOR_FLAG_OTA_REQ)) {
		/* no trigger bit — fast path */
	} else if (payload->length >= kV3AnchorSize) {
		/* v3+ anchor (10, 11, 16 bytes all carry ota_target_node_id) */
		if (anchor->ota_target_node_id == g_node_id ||
		    anchor->ota_target_node_id == 0xFFu) {
			atomic_set(&ota_reboot_pending, 1);
		}
	} else if (payload->length >= kV2AnchorSize) {
		/* legacy 9-byte anchor — no target field, legacy semantics */
		atomic_set(&ota_reboot_pending, 1);
	}

	/* Stage 1 instrumentation (docs/RF_SYNC_DECISION_LOG.md):
	 * Record how stale the anchor is vs. our most recent TX. A tight
	 * distribution near 0 = Hub hits the TIFS fast path. A long tail
	 * at 20 ms+ = Hub is mostly on the slow path (anchor rode a later
	 * frame's ACK). Use last_tx_local_us captured in maybe_send_frame. */
	const uint32_t tx_us_snapshot = last_tx_local_us;
	if (tx_us_snapshot != 0u && local_us >= tx_us_snapshot) {
		(void)histo_bucket_us(local_us - tx_us_snapshot, anchor_age_bucket);
	}

	/* Stage 2 (v4 anchor): if this anchor was built from some other
	 * Tag's frame (cross-contamination on the shared ACK-payload FIFO),
	 * don't let it corrupt our sync estimator. Count for diagnostics
	 * but skip the offset/anchors_received update. Pre-v4 anchors
	 * (< 11 B) have no rx_node_id field — accept them unconditionally
	 * to preserve backward compat with older Hubs during migration. */
	if (payload->length >= kV4AnchorSize &&
	    anchor->rx_node_id != 0xFFu &&
	    anchor->rx_node_id != g_node_id) {
		anchors_wrong_rx++;
		return;
	}

	/* Stage 3 (v5 anchor): midpoint RTT estimator. Look up our own
	 * TX timestamp via the echoed rx_frame_sequence — that gives us
	 * T_tx_us for the exact TX round-tripped through this anchor. The
	 * midpoint math cancels TIFS variance on both sides:
	 *   tag_mid = (T_tx_us + T_rx_us) / 2
	 *   hub_mid = (H_rx_us + H_tx_us) / 2
	 *   offset  = tag_mid - hub_mid
	 * Where H_rx_us = central_timestamp_us (unchanged) and
	 * H_tx_us = anchor_tx_us (new in v5). */
	if (payload->length >= sizeof(*anchor)) {
		const uint8_t want_seq = anchor->rx_frame_sequence;
		uint32_t tx_us = 0u;
		bool found = false;
		/* Walk backward from head; bounded by ring size. Producer is
		 * single-writer (maybe_send_frame), consumer is ESB ISR — a
		 * new TX could happen mid-walk, but we just might miss the
		 * newest entry which wouldn't have been ours anyway. */
		const uint32_t head_snap = tx_ring_head;
		for (uint32_t i = 0u; i < HELIX_TX_RING_SIZE; i++) {
			const uint32_t idx = (head_snap - 1u - i) & HELIX_TX_RING_MASK;
			const struct tx_stamp slot = {
				.sequence = tx_ring[idx].sequence,
				.valid    = tx_ring[idx].valid,
				.local_us = tx_ring[idx].local_us,
			};
			if (slot.valid && slot.sequence == want_seq) {
				tx_us = slot.local_us;
				found = true;
				break;
			}
		}
		if (!found) {
			seq_lookup_miss++;
		} else {
			/* Midpoint — handles uint32 wraparound via signed diffs.
			 * On nRF52 now_us() is a 64-bit k_uptime-derived counter
			 * cast to uint32; wrap period is ~71 min, far longer than
			 * a round trip. Use midpoint average to avoid overflow:
			 *   mid = a + ((b - a) / 2)  (same as (a+b)/2 but safe). */
			const uint32_t tag_mid = tx_us + ((local_us - tx_us) / 2u);
			const uint32_t hub_mid = anchor->central_timestamp_us +
			                        ((anchor->anchor_tx_us -
			                          anchor->central_timestamp_us) / 2u);
			const int32_t new_midpoint = (int32_t)(tag_mid - hub_mid);
			if (midpoint_offset_valid) {
				const int64_t mdiff = (int64_t)new_midpoint - (int64_t)midpoint_offset_us;
				const uint32_t mdiff_abs = (uint32_t)((mdiff < 0) ? -mdiff : mdiff);
				(void)histo_bucket_us(mdiff_abs, midpoint_step_bucket);
			}
			midpoint_offset_us = new_midpoint;
			midpoint_offset_valid = 1u;
		}
	}

	const int32_t prev_offset = estimated_offset_us;
	estimated_offset_us = (int32_t)(local_us - anchor->central_timestamp_us);
	g_helixMocapStatus.estimated_offset_us = estimated_offset_us;
	g_helixMocapStatus.anchors_received++;
	have_anchor = true;

	/* Bucket the magnitude of the offset jump on this anchor. Small steps
	 * → clock is tracking smoothly; large steps → stale/wrong-Tag anchor
	 * corrupted the estimator. After Stage 2 v4 gate above, only
	 * matching-Tag anchors reach this point — distribution should
	 * collapse toward bucket 0. */
	const int64_t diff = (int64_t)estimated_offset_us - (int64_t)prev_offset;
	const uint32_t diff_abs = (uint32_t)((diff < 0) ? -diff : diff);
	(void)histo_bucket_us(diff_abs, offset_step_bucket);
}
#endif

static void event_handler(struct esb_evt const *event)
{
	switch (event->evt_id) {
	case ESB_EVENT_TX_SUCCESS:
		g_helixMocapStatus.tx_success++;
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
		/* Hub (PRX) TX_SUCCESS fires when a queued ACK payload (the
		 * anchor built in central_handle_frame) has been successfully
		 * transmitted. Pull the OLDEST queue timestamp off the ring —
		 * that's the anchor this TX_SUCCESS just delivered — and
		 * bucket the latency. Ring semantics: head is bumped on each
		 * enqueue in central_handle_frame; tail advances here on each
		 * successful TX. Both run from the same ESB ISR context in
		 * NCS v3.2.4, so no locking. */
		{
			const uint32_t tx_done_us = now_us();
			const uint32_t tail = anchor_queue_ring_tail;
			const uint32_t head = anchor_queue_ring_head;
			if (tail != head) {
				const uint32_t queue_us =
					anchor_queue_ts_ring[tail & HELIX_ANCHOR_QUEUE_MASK];
				anchor_queue_ring_tail = tail + 1u;
				if (tx_done_us >= queue_us) {
					(void)histo_bucket_us(tx_done_us - queue_us,
					                      ack_tx_latency_bucket);
				}
			} else {
				ack_tx_dropped_no_queue++;
			}
		}
#endif
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
		atomic_set(&tx_ready, 1);
#endif
		break;
	case ESB_EVENT_TX_FAILED:
		g_helixMocapStatus.tx_failed++;
		(void)esb_flush_tx();
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
		atomic_set(&tx_ready, 1);
#endif
		break;
	case ESB_EVENT_RX_RECEIVED:
		while (esb_read_rx_payload(&rx_payload) == 0) {
			g_helixMocapStatus.rx_packets++;
			g_helixMocapStatus.last_rx_len = rx_payload.length;
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
			central_handle_frame(&rx_payload);
#else
			node_handle_anchor(&rx_payload);
#endif
		}
		break;
	default:
		break;
	}
}

static int esb_initialize(void)
{
	int err;
	uint8_t base_addr_0[4] = {0xD3, 0xC1, 0xB2, 0xA1};
	uint8_t base_addr_1[4] = {0x44, 0x33, 0x22, 0x11};
	uint8_t addr_prefix[8] = {0xE7, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7, 0xC8};
	struct esb_config config = ESB_DEFAULT_CONFIG;

