Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
	config.protocol = ESB_PROTOCOL_ESB_DPL;
	config.bitrate = ESB_BITRATE_2MBPS;
	config.event_handler = event_handler;
	/* Per-Tag retransmit_delay spread so when two Tags collide their
	 * retries land at different times. 600 µs base + 50 µs × node_id
	 * gives 650 µs (node 1) through 1100 µs (node 10) — 450 µs spread.
	 * Hub (central) stays at the base value because PRX doesn't retry
	 * on collision anyway. */
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
	config.retransmit_delay = static_cast<uint16_t>(600u + (uint16_t)g_node_id * 50u);
#else
	config.retransmit_delay = 600;
#endif
	/* retransmit_count 6 → 10: with 10 Tags on pipe 0 a chunk is up
	 * against ~9 other Tags for any given air slot; more retries
	 * compensates for the elevated collision rate (Phase A baseline
	 * showed 38-46 Hz / Tag vs 50 Hz target, i.e. 12-24 % loss). */
	config.retransmit_count = 10;
	config.selective_auto_ack = true;
	config.payload_length = 32;
	config.mode =
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
		ESB_MODE_PRX;
#else
		ESB_MODE_PTX;
#endif

	err = esb_init(&config);
	if (err) {
		return err;
	}

	err = esb_set_base_address_0(base_addr_0);
	if (err) {
		return err;
	}

	err = esb_set_base_address_1(base_addr_1);
	if (err) {
		return err;
	}

	err = esb_set_prefixes(addr_prefix, ARRAY_SIZE(addr_prefix));
	if (err) {
		return err;
	}

	err = esb_set_rf_channel(CONFIG_HELIX_MOCAP_RF_CHANNEL);
	if (err) {
		return err;
	}

	(void)esb_flush_tx();
	(void)esb_flush_rx();
	return 0;
}

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
static void maybe_send_frame(void)
{
	struct HelixMocapFrame frame;
	int err;

	if (!atomic_cas(&tx_ready, 1, 0)) {
		return;
	}

	node_fill_frame(&frame);
	tx_payload.pipe = CONFIG_HELIX_MOCAP_PIPE;
	tx_payload.noack = 0;
	tx_payload.length = sizeof(frame);
	memcpy(tx_payload.data, &frame, sizeof(frame));

	g_helixMocapStatus.last_sequence = frame.sequence;
	g_helixMocapStatus.last_node_id = frame.node_id;
	g_helixMocapStatus.tx_attempts++;

	/* Stage 3.6: push to the seq-indexed ring BEFORE esb_write_payload
	 * so the anchor ISR (which can fire as soon as Hub's ACK returns)
	 * always sees the matching TX entry. Publishing order matters on
	 * single-core nRF52 — valid=1 store must come last so a racing
	 * reader sees either "not here yet" or "fully populated." */
	const uint32_t tx_us = now_us();
	const uint32_t head_pre = tx_ring_head;
	const uint32_t idx = head_pre & HELIX_TX_RING_MASK;
	tx_ring[idx].sequence = frame.sequence;
	tx_ring[idx].local_us = tx_us;
	__DMB(); /* ensure sequence/local_us are visible before valid=1 */
	tx_ring[idx].valid    = 1u;
	tx_ring_head = head_pre + 1u;
	last_tx_local_us = tx_us;

	err = esb_write_payload(&tx_payload);
	if (err) {
		status_set_error(err);
		atomic_set(&tx_ready, 1);
		/* Unwind the ring entry — the anchor for this seq will never
		 * come back because the TX failed. Leaving it valid could
		 * give a false-match to a later anchor that happens to echo
		 * the same sequence byte (seq wraps every 256). */
		tx_ring[idx].valid = 0u;
		tx_ring_head = head_pre;
	}
}
#endif

/* ── BLE OTA Boot Window (node role only) ──────────────────────── */
#if defined(CONFIG_BT) && defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE) && \
    (CONFIG_HELIX_OTA_BOOT_WINDOW_MS > 0)

#define BT_UUID_HELIX_OTA_SERVICE_VAL \
    BT_UUID_128_ENCODE(0x3ef6a001, 0x2d3b, 0x4f2a, 0x89e4, 0x7b59d1c0a001)
#define BT_UUID_HELIX_OTA_CTRL_VAL \
    BT_UUID_128_ENCODE(0x3ef6a002, 0x2d3b, 0x4f2a, 0x89e4, 0x7b59d1c0a001)
#define BT_UUID_HELIX_OTA_DATA_VAL \
    BT_UUID_128_ENCODE(0x3ef6a003, 0x2d3b, 0x4f2a, 0x89e4, 0x7b59d1c0a001)
#define BT_UUID_HELIX_OTA_STATUS_VAL \
    BT_UUID_128_ENCODE(0x3ef6a004, 0x2d3b, 0x4f2a, 0x89e4, 0x7b59d1c0a001)

static struct bt_uuid_128 ota_svc_uuid = BT_UUID_INIT_128(BT_UUID_HELIX_OTA_SERVICE_VAL);
static struct bt_uuid_128 ota_ctrl_uuid = BT_UUID_INIT_128(BT_UUID_HELIX_OTA_CTRL_VAL);
static struct bt_uuid_128 ota_data_uuid = BT_UUID_INIT_128(BT_UUID_HELIX_OTA_DATA_VAL);
static struct bt_uuid_128 ota_status_uuid = BT_UUID_INIT_128(BT_UUID_HELIX_OTA_STATUS_VAL);

static helix::ZephyrOtaFlashBackend ota_backend;
static helix::OtaManager ota_manager{ota_backend};
static helix::OtaManagerAdapter ota_adapter{ota_manager};
static helix::BleOtaService ota_service{ota_adapter, CONFIG_HELIX_OTA_TARGET_ID};

static struct bt_conn *ota_conn;
static bool ota_connected;

static volatile bool ota_commit_pending;

/* Deferred BEGIN: flash erase takes ~10s and would block the BLE stack
 * if run inside the GATT callback, causing supervision timeout. Instead,
 * we save the BEGIN parameters and process them in the main OTA loop. */
static volatile bool ota_begin_pending;
static uint8_t ota_begin_buf[16];
static uint16_t ota_begin_len;

static ssize_t ota_write_ctrl(struct bt_conn *, const struct bt_gatt_attr *,
                              const void *buf, uint16_t len, uint16_t, uint8_t)
{
	const auto *data = static_cast<const uint8_t *>(buf);

	/* Defer BEGIN (cmd=0x01) to the main loop — flash erase is too slow
	 * to run inside the GATT callback. But validate payload *here* so we
	 * can NACK immediately on bad target_id or short payload; otherwise
	 * the uploader would think BEGIN succeeded and poll STATUS forever
	 * while the main-loop handleControlWrite silently rejects. */
	if (len > 0 && data[0] == helix::BleOtaService::CMD_BEGIN) {
		if (len < helix::BleOtaService::kCtrlBeginMinLen ||
		    len > sizeof(ota_begin_buf)) {
			return BT_GATT_ERR(BT_ATT_ERR_VALUE_NOT_ALLOWED);
		}
		/* Validate target_id before accepting.
		 * Layout: [cmd:1][size:4][crc:4][tid:4] — target_id at offset 9..12.
		 * kCtrlBeginMinLen is 13, so the len check above guarantees data[9..12]
		 * are in bounds; static_assert pins the relationship so a future
		 * refactor can't silently break it. */
		static_assert(helix::BleOtaService::kCtrlBeginMinLen >= 13u,
		              "BEGIN payload must be at least 13 bytes for target_id at offset 9..12");
		uint32_t req_tid;
		memcpy(&req_tid, &data[9], sizeof(req_tid));
		if (req_tid != (uint32_t)CONFIG_HELIX_OTA_TARGET_ID) {
			/* Audible failure. Previously this returned silently; if an
			 * uploader ever targets a mixed-firmware fleet with the wrong
			 * --target-id, the only symptom was a GATT NACK from here
			 * with no clue which side was off. */
			printk("ota: BEGIN rejected — target_id 0x%08x != expected 0x%08x\n",
			       (unsigned)req_tid,
			       (unsigned)CONFIG_HELIX_OTA_TARGET_ID);
			return BT_GATT_ERR(BT_ATT_ERR_VALUE_NOT_ALLOWED);
		}
		memcpy(ota_begin_buf, data, len);
		ota_begin_len = len;
		ota_begin_pending = true;
		return static_cast<ssize_t>(len); /* ACK, main loop does erase */
	}

