Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
	/* ── ESB mocap mode ─────────────────────────────────── */
	err = esb_initialize();
	if (err) {
		status_set_error(err);
	}
	g_helixMocapStatus.phase = 4U;

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
	err = esb_start_rx();
	if (err) {
		status_set_error(err);
	}
#endif

	host_write("HELIX_MOCAP_BRIDGE_READY\n");

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
	/* Per-Tag boot-time TX phase offset. All 10 Tags leaving the 300 s
	 * BLE OTA window at slightly different wallclocks naturally spread
	 * their TX phase, but when everyone reaches the main loop near the
	 * same instant (e.g. after a synchronised Hub reset) they tend to
	 * collide in lockstep. A one-off 200 µs × node_id sleep here gives
	 * an initial spread of 200..2000 µs across the fleet. LF clock
	 * differences will drift it over time, but this gets us started
	 * clean. Measured Phase A baseline: 38-46 Hz/Tag; target is 50 Hz. */
	if (g_node_id > 0u) {
		k_usleep((uint32_t)g_node_id * 200u);
	}
#endif

	static bool esb_running = true;

	while (1) {
		heartbeat_tick();

#if defined(CONFIG_HELIX_OTA_HUB_RELAY)
		/* Check if OTA relay needs to stop ESB */
		if (esb_running && ota_hub_relay_needs_esb_stop()) {
			printk("hub: stopping ESB for OTA relay\n");
			esb_disable();
			k_sleep(K_MSEC(100)); /* let radio peripheral settle */
			esb_running = false;
		}

		/* Poll OTA relay (processes USB RX, drives BLE state machine) */
		ota_hub_relay_poll();

		/* Check if OTA session ended and ESB can restart */
		if (!esb_running && ota_hub_relay_esb_can_restart()) {
			printk("hub: restarting ESB after OTA relay\n");
			esb_initialize();
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
			esb_start_rx();
#endif
			esb_running = true;
			host_write("HELIX_MOCAP_BRIDGE_READY\n");
		}
#endif

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
		/* Handle deferred OTA reboot triggered from ESB ISR */
		if (atomic_cas(&ota_reboot_pending, 1, 0)) {
			printk("ota: ESB trigger received, rebooting\n");
			k_sleep(K_MSEC(50));
			sys_reboot(SYS_REBOOT_COLD);
		}
		maybe_send_frame();
#endif
		if ((g_helixMocapStatus.heartbeat % 25U) == 0U) {
			report_summary();
		}
		k_sleep(K_MSEC(CONFIG_HELIX_MOCAP_SEND_PERIOD_MS));
	}

	return 0;
}
